Revit 2027 API
Application.Cities Property
Returns a set of all the known city locations within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CitySet Cities { get; }
Public ReadOnly Property Cities As CitySet
	Get
public:
property CitySet^ Cities {
	CitySet^ get ();
}
member Cities : CitySet with get
Property Value
CitySet
Remarks
Each city has information about longitude, latitude etc.
Example
// Get all Revit support cities
Autodesk.Revit.DB.CitySet cities = application.Cities;
// Set all Revit support cities into an ArrayList
System.Collections.ArrayList cityList = new System.Collections.ArrayList();
foreach (Autodesk.Revit.DB.City city in cities)
{
    cityList.Add(city);
}
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace